Delans-TLE/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>БланкДоговора</name>
    <type>
      <types>CatalogRef.БланкиДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДнейДоВыставленияДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияМесяцевДоВыставленияДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияПериодичность</name>
    <type>
      <types>EnumRef.БиллингПериодичностьДоговораОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияТарифныйПлан</name>
    <type>
      <types>CatalogRef.ТарифныеПланыДоговоровОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ES_ПроцентКомиссииНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ES_ПроцентКомиссииБезнал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорОбслуживания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ES_Продукт</name>
    <type>
      <types>EnumRef.ES_СрочностьДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетТарифаОтБольшегоВеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ES_УчетПриРасчетеЦенТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ES_РасчетТарифовОтМаксимальногоВеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <type>
      <types>EnumRef.СпособыЗачетаИРаспределенияПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <type>
      <types>EnumRef.СпособыЗачетаИРаспределенияПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорЭквайринга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВзаиморасчетовЭквайринг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетКомиссиВОтчетеЭквайера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПодписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорОбслуживанияПолучателиРассылки</name>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РедактируемыеПараметры</name>
    <attributes>
      <name>СсылкаБланка</name>
      <type>
        <types>CatalogRef.БланкиДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИнфобазы</name>
    <attributes>
      <name>СсылкаБланка</name>
      <type>
        <types>CatalogRef.БланкиДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>EnumRef.ПараметрыБланковДоговоровСКонтрагентами</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем УстановкаОсновногоДоговораВыполнена; // Признак успешной установки основного договора из формы контрагента

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат; // Возврат при получении формы для анализа.
	КонецЕсли;
	Параметры.Свойство("КонтролироватьВыборДоговора", КонтролироватьВыборДоговора);
	Параметры.Свойство("Организация"  , Организация);
	Параметры.Свойство("ВидыДоговоров", ВидыДоговоров);
	
	КоличествоДнейКОповещению = 7;
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПечатьДокументовУНФ.КорректировкаРазмещениеПодчиненнойГруппыКомандПечати(ЭтаФорма, Элементы.ПодменюПечать, Элементы.ПодменюДоговорКонтрагента);
	Элементы.КомандыПечатиДоговорКонтрагента.Вид = ВидГруппыФормы.ГруппаКнопок;
	ШаблоныПечатиОфисныхДокументов.ОпределитьВидимостьКомандШаблоновПечати(Элементы.ФормаОткрытьШаблоныПечатиДоговоровКонтрагентов);
	
	Список.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(НастройкиОформленияСпискаДоговоров());
	УстановитьУсловноеОформление();
	
	
	Если Параметры.Отбор.Свойство("Владелец", КонтрагентВладелец) Тогда
		Параметры.Отбор.Удалить("Владелец");
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(КонтрагентВладелец) Тогда
		Параметры.Свойство("Контрагент", КонтрагентВладелец);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрагентВладелец)Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Владелец", КонтрагентВладелец);
		Элементы.Контрагенты.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Покупатель") Тогда
		ОтборВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
		Параметры.Отбор.Удалить("Покупатель");
	ИначеЕсли Параметры.Отбор.Свойство("Поставщик") Тогда
		ОтборВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
		Параметры.Отбор.Удалить("Поставщик");
	КонецЕсли;
	
	Элементы.ОтборВидДоговора.СписокВыбора.Очистить();
	
	Элементы.ОтборВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоров.СПокупателем);
	Элементы.ОтборВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоров.СПоставщиком);
	
	Если Константы.ФункциональнаяОпцияПередачаТоваровНаКомиссию.Получить() Тогда
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоров.СКомиссионером);
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияПриемТоваровНаКомиссию.Получить() Тогда
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоров.СКомитентом);
	КонецЕсли;
	
	Элементы.ОтборВидДоговора.СписокВыбора.Добавить(Перечисления.ВидыДоговоров.Прочее);
	ПравоНаРедактирование = ПравоДоступа("Редактирование", Метаданные.Справочники.Контрагенты);
	Если ЗначениеЗаполнено(КонтрагентВладелец) Тогда
		// Контекстное открытие формы с отбором по контрагенту
	
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Договоры с'") + " """ + КонтрагентВладелец + """";
		
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтрагентВладелец,
			"Покупатель, Поставщик, ПрочиеОтношения");
		Элементы.Владелец.Видимость = Ложь;
		
		Элементы.ВидЦен.Видимость				= РеквизитыКонтрагента.Покупатель Или РеквизитыКонтрагента.ПрочиеОтношения;
		Элементы.ВидСкидкиНаценки.Видимость		= РеквизитыКонтрагента.Покупатель Или РеквизитыКонтрагента.ПрочиеОтношения;
		Элементы.ВидЦенКонтрагента.Видимость	= РеквизитыКонтрагента.Поставщик Или РеквизитыКонтрагента.ПрочиеОтношения;
		Элементы.СрокОплатыПокупателя.Видимость	= РеквизитыКонтрагента.Покупатель Или РеквизитыКонтрагента.ПрочиеОтношения;
		Элементы.СрокОплатыПоставщику.Видимость	= РеквизитыКонтрагента.Поставщик Или РеквизитыКонтрагента.ПрочиеОтношения;
		
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", КонтрагентВладелец);
		Элементы.ИспользоватьКакОсновной.Видимость = ПравоНаРедактирование;
	Иначе
		// Открытие в общем режиме
	
		Список.ТекстЗапроса = ТекстЗапросаОбщегоСписка();
		Элементы.Владелец.Видимость = Истина;
		Элементы.Взаиморасчеты.Видимость = Ложь;
		
		Элементы.ИспользоватьКакОсновной.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ПустаяДата", Дата('00010101'));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Недействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
	Если Параметры.РежимВыбора Тогда
		КлючНазначенияИспользования = "ВыборПодбор";
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Иначе
		КлючНазначенияИспользования = "Список";
	КонецЕсли;
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.ДоговорыКонтрагентов);
	Элементы.ИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// УНФ.ОтборыСписка
	Если НЕ Параметры.РежимВыбора И НЕ ЗначениеЗаполнено(КонтрагентВладелец) Тогда
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список,,,Новый Структура("ОтборПериод", "СрокДействия"));
	Иначе
		РаботаСОтборами.НастроитьПанельОтборовМобильныйКлиент(ЭтотОбъект);
	КонецЕсли;
	// Конец УНФ.ОтборыСписка
	УстановитьВидимость(ЭтаФорма);
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Элементы.ФормаОбщаяКомандаНапомнить.Видимость = Ложь;
		Элементы.ПраваяПанель.Видимость = Ложь;
	КонецЕсли
	;
	// Конец МобильноеПриложение
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаОсновногоДоговораВыполнена" Тогда
		УстановкаОсновногоДоговораВыполнена = Истина;
	КонецЕсли;
	
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	//УНФ.ОтборыСписка
	Если НЕ Параметры.РежимВыбора И НЕ ЗначениеЗаполнено(КонтрагентВладелец) Тогда
		СохранитьНастройкиОтборов();
	КонецЕсли;
	//Конец УНФ.ОтборыСписка
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборДействуетНа     = Настройки.Получить("ОтборДействуетНа");
	ОтборДоговорПодписан = Настройки.Получить("ОтборДоговорПодписан");
	КоличествоДнейКОповещению = Настройки.Получить("КоличествоДнейКОповещению");
	
	УстановитьОтборы();
	ИзменитьОФормлениеОтображенияЗаканчивающихсяДоговоров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка")
		И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ИспользоватьКакОсновной.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоОсновнойДоговор;
		
		КонтрагентАктивнойСтроки = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.Владелец);
		Если КонтрагентАктивнойСтроки <> ТекущийКонтрагент Тогда
		
			ТекущийКонтрагент = КонтрагентАктивнойСтроки;
			ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Недействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорПодписанПриИзменении(Элемент)
	УстановитьОтборДоговорПодписанСервер();
КонецПроцедуры


&НаКлиенте
Процедура ОтборДействуетНаПриИзменении(Элемент)
	УстановитьОтборДействуетНаСервер();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекстВопроса = "";
	
	Если Не ПроверитьСоответствиеДоговораУсловиямДокумента(КонтролироватьВыборДоговора, ТекстВопроса, Значение, Организация, КонтрагентВладелец, ВидыДоговоров) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("Значение", Значение);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокВыборЗначенияЗавершение", ЭтотОбъект, ПараметрыВопроса);
		ТекстВопроса = ТекстВопроса + НСтр("ru = '
			|
			|Выбрать другой договор?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОповеститьОВыборе(ДополнительныеПараметры.Значение);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КоличествоДнейКОповещениюПриИзменении(Элемент)
	ИзменитьОФормлениеОтображенияЗаканчивающихсяДоговоров();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "СрокДействия");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Владелец", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	УстановитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВидДоговора", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьШаблоныПечатиДоговоровКонтрагентов(Команда)
	
	УправлениеНебольшойФирмойКлиент.ОткрытьШаблоныПечатиОфисныхДокументов(
	ПредопределенноеЗначение("Перечисление.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакОсновной(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Элементы.Список.ТекущиеДанные = Неопределено
		Или Элементы.Список.ТекущиеДанные.ЭтоОсновнойДоговор Тогда
		
		Возврат;
	КонецЕсли;
	
	НовыйОсновнойДоговор = Элементы.Список.ТекущиеДанные.Ссылка;
	
	// Если открыта форма контрагента, то изменение основного договора выполняем в ней
	УстановкаОсновногоДоговораВыполнена = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент", Элементы.Список.ТекущиеДанные.Владелец);
	СтруктураПараметров.Вставить("НовыйОсновнойДоговор", НовыйОсновнойДоговор);
	
	ЗаписатьОсновнойДоговорКонтрагента(СтруктураПараметров);
	
	// Обновим динамический список
	Элементы.Список.Обновить();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(ЭтаФорма)
	СтрокиСКонтрагентом = ЭтаФорма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора","Владелец"));
	Элементы = ЭтаФорма.Элементы;
	Если  СтрокиСКонтрагентом.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.КонтрагентВладелец) Тогда
			Элементы.ИспользоватьКакОсновной.Видимость = ЭтаФорма.ПравоНаРедактирование;
			Элементы.ЭтоОсновнойДоговор.Видимость = Истина;
		Иначе
			Элементы.ИспользоватьКакОсновной.Видимость = Ложь;
			Элементы.ЭтоОсновнойДоговор.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ИспользоватьКакОсновной.Видимость = ЭтаФорма.ПравоНаРедактирование;
		Элементы.ЭтоОсновнойДоговор.Видимость = Истина;
		Если СтрокиСКонтрагентом.Количество() = 1 Тогда
			Элементы.Владелец.Видимость = Ложь;
		Иначе
			Элементы.Владелец.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьОФормлениеОтображенияЗаканчивающихсяДоговоров() Экспорт
	
	НайденноеОформление = Неопределено;
	Для Каждого Оформление Из  Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы Цикл
		Если Оформление.Представление = "ОтображениеЗаканчивающихсяДоговоров" Тогда
			НайденноеОформление = Оформление;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденноеОформление <> Неопределено Тогда
		Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Удалить(НайденноеОформление);
	КонецЕсли;
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	НовоеУсловноеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	НовоеУсловноеОформление.Представление = "ОтображениеЗаканчивающихсяДоговоров";
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора;
	Оформление.Использование 	= Истина;
	
	ГруппаЭлементовОтбора = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.Использование = Истина;
	ГруппаЭлементовОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = КоличествоДнейКОповещению;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
	ОбновитьПанельКонтактнойИнформацииСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаОбщегоСписка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентовПереопределяемый.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	|	ДоговорыКонтрагентовПереопределяемый.Владелец КАК Владелец,
	|	ДоговорыКонтрагентовПереопределяемый.Родитель КАК Родитель,
	|	ДоговорыКонтрагентовПереопределяемый.Код КАК Код,
	|	ДоговорыКонтрагентовПереопределяемый.Наименование КАК Наименование,
	|	ДоговорыКонтрагентовПереопределяемый.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ДоговорыКонтрагентовПереопределяемый.ДатаДоговора КАК ДатаДоговора,
	|	ДоговорыКонтрагентовПереопределяемый.Организация КАК Организация,
	|	ДоговорыКонтрагентовПереопределяемый.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентовПереопределяемый.НомерДоговора КАК НомерДоговора,
	|	ДоговорыКонтрагентовПереопределяемый.СрокОплатыПокупателя КАК СрокОплатыПокупателя,
	|	ДоговорыКонтрагентовПереопределяемый.СрокОплатыПоставщику КАК СрокОплатыПоставщику,
	|	ДоговорыКонтрагентовПереопределяемый.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентовПереопределяемый.ВидЦен КАК ВидЦен,
	|	ДоговорыКонтрагентовПереопределяемый.ВидЦенКонтрагента КАК ВидЦенКонтрагента,
	|	ДоговорыКонтрагентовПереопределяемый.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
	|	ДоговорыКонтрагентовПереопределяемый.БланкДоговора КАК БланкДоговора,
	|	ОсновныеДоговорыКонтрагента.Договор ЕСТЬ НЕ NULL  КАК ЭтоОсновнойДоговор,
	|	ДоговорыКонтрагентовПереопределяемый.Недействителен КАК Недействителен,
	|	ДоговорыКонтрагентовПереопределяемый.Комментарий КАК Комментарий,
	|	ДоговорыКонтрагентовПереопределяемый.СрокДействия КАК СрокДействия,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентовПереопределяемый.СрокДействия = &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДействуетБессрочно,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентовПереопределяемый.СрокДействия = &ПустаяДата
	|			ТОГДА 999
	|		ИНАЧЕ РАЗНОСТЬДАТ(&ТекущаяДата, ДоговорыКонтрагентовПереопределяемый.СрокДействия, ДЕНЬ)
	|	КОНЕЦ КАК ОсталосьДнейПоДоговору,
	|	ДоговорыКонтрагентовПереопределяемый.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	ДоговорыКонтрагентовПереопределяемый.РедактируемыеПараметры.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		СсылкаБланка КАК СсылкаБланка,
	|		Представление КАК Представление,
	|		Значение КАК Значение,
	|		Идентификатор КАК Идентификатор
	|	) КАК РедактируемыеПараметры,
	|	ДоговорыКонтрагентовПереопределяемый.ПараметрыИнфобазы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		СсылкаБланка КАК СсылкаБланка,
	|		Представление КАК Представление,
	|		Значение КАК Значение,
	|		Идентификатор КАК Идентификатор,
	|		Параметр КАК Параметр
	|	) КАК ПараметрыИнфобазы,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НаличиеФайлов.ЕстьФайлы
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьФайлы
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентовПереопределяемый
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО (ОсновныеДоговорыКонтрагента.Договор = ДоговорыКонтрагентовПереопределяемый.Ссылка)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|		ПО ДоговорыКонтрагентовПереопределяемый.Ссылка = НаличиеФайлов.ОбъектСФайлами}";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьОсновнойДоговорКонтрагента(СтруктураПараметров)
	
	ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураПараметров.НовыйОсновнойДоговор,"Организация, ВидДоговора");
	
	РегистрыСведений.ОсновныеДоговорыКонтрагента.ОчиститьЗаписиСДоговором(СтруктураПараметров.НовыйОсновнойДоговор);
	
	Запись = РегистрыСведений.ОсновныеДоговорыКонтрагента.СоздатьМенеджерЗаписи();
	Запись.Организация = ПараметрыДоговора.Организация;
	Запись.ВидДоговора =  ПараметрыДоговора.ВидДоговора;
	Запись.Контрагент =  СтруктураПараметров.Контрагент;
	Запись.Договор = СтруктураПараметров.НовыйОсновнойДоговор;
	
	Запись.Записать();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Недействительный контрагент отображается серым
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Недействителен");
	Отбор.ПравоеЗначение 	= Истина;
	
	// 2.  заканчивается договор - отображаем оранжевым
	
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	НовоеУсловноеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	НовоеУсловноеОформление.Представление = "ОтображениеЗаканчивающихсяДоговоров";
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора;
	Оформление.Использование 	= Истина;
	
	ГруппаЭлементовОтбора = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.Использование = Истина;
	ГруппаЭлементовОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = КоличествоДнейКОповещению;
	
	// 3.  отображение бессрочных в статусе
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Текст");
	Оформление.Значение 		= НСтр("ru = 'Бессрочный'");
	Оформление.Использование 	= Истина;
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДействуетБессрочно");
	Отбор.ПравоеЗначение 	= Истина;
	ЭлементПоля = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	
	// 4.  закончился договор - отображаем красным
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ПросроченноеЗадание;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Меньше;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	Отбор.ПравоеЗначение 	= 0;
	
	СписокУдаляемыхЭлементов = Новый СписокЗначений;
	Для каждого ЭлементУсловногоОформления Из Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный"
			И ЭлементУсловногоОформления.Представление = "Не соответствуют условиям документа" Тогда
			СписокУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Удалить(Элемент.Значение);
	КонецЦикла;
	
	Если Не КонтролироватьВыборДоговора Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементУсловногоОформления = Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
	ГруппаИЛИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаИЛИ.Использование = Истина;
	
	ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	Если ВидыДоговоров.Количество() > 0 Тогда
		ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДоговора");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.ПравоеЗначение = ВидыДоговоров;
	КонецЕсли;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
	ЭлементУсловногоОформления.Представление = "Не соответствуют условиям документа";
	

КонецПроцедуры


&НаСервере
Функция НастройкиОформленияСпискаДоговоров()
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		Неопределено, -1, НСтр("ru = 'Просрочен'"));
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		0, 0, НСтр("ru = 'Заканчивается сегодня'"));
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		1, 1, НСтр("ru = 'Заканчивается завтра'"));
	
	Шаблон = НСтр("ru = 'Осталось %1'");
	
	Для РазностьДат = 2 По 6 Цикл
		СтрокаРазностьДат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(";%1 день;;%1 дня;%1 дней;%1 дня", РазностьДат);
		ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
			РазностьДат, РазностьДат, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаРазностьДат));
	КонецЦикла;
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		7, 13, НСтр("ru = 'Осталась неделя'"));
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		14, 18, НСтр("ru = 'Осталось 2 недели'"));
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		19, 22, НСтр("ru = 'Осталось 3 недели'"));
	
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		23, 34, НСтр("ru = 'Остался месяц'"));
		
	ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных,
		35, Неопределено, " Осталось больше месяца");
	
	// Добавляем оформление для случая, когда  договор недействителен
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Недействителен'"));
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Недействителен");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных("ОсталосьДнейПоДоговору");
	
	Возврат НастройкиКомпоновкиДанных;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементУсловногоОформленияСписка(НастройкиКомпоновкиДанных, НижняяГраница, ВерхняяГраница, Текст = Неопределено, ЦветТекста = Неопределено)
	
	ПутьКДаннымПоля = "ОсталосьДнейПоДоговору";
	
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	
	Если ЦветТекста <> Неопределено Тогда
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
	КонецЕсли;
	
	Если Текст <> Неопределено Тогда
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
	КонецЕсли;
	
	Если НижняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	ИначеЕсли ВерхняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	ИначеЕсли НижняяГраница = ВерхняяГраница Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	Иначе
		
		ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаЭлементовОтбора.Использование = Истина;
		ГруппаЭлементовОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	КонецЕсли;
	
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	Если Текст = Неопределено Тогда
		ЭлементПоля.Поле = Новый ПолеКомпоновкиДанных("Список");
	Иначе
		ЭлементПоля.Поле = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет соответствие реквизитов договора "Организация" и "ВидДоговора" переданным параметрам.
//
&НаСервереБезКонтекста
Функция ПроверитьСоответствиеДоговораУсловиямДокумента(КонтролироватьСоответствиеДокументу, ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора)
	
	Если Не КонтролироватьСоответствиеДокументу Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора);
	
КонецФункции

#КонецОбласти

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
	Если КонтролироватьВыборДоговора Тогда
		Если ЗначениеЗаполнено(КонтрагентВладелец)
			И ЗначениеЗаполнено(Организация)
			И ВидыДоговоров.Количество() > 0 Тогда
			
			Отказ = Истина;
			
			ДанныеЗаполненияДоговора = Новый Структура;
			ДанныеЗаполненияДоговора.Вставить("Владелец", КонтрагентВладелец);
			Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
				ДанныеЗаполненияДоговора.Вставить("Организация", ОтборОрганизация);
			Иначе
				ДанныеЗаполненияДоговора.Вставить("Организация", Организация);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОтборВидДоговора) Тогда
				ДанныеЗаполненияДоговора.Вставить("ВидДоговора", ОтборВидДоговора);
			ИначеЕсли ВидыДоговоров.Количество() > 0 Тогда
				ДанныеЗаполненияДоговора.Вставить("ВидДоговора", ВидыДоговоров[0].Значение);
			КонецЕсли;
			
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполненияДоговора);
			
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, Элемент);
		КонецЕсли;
	Иначе
		
		ДанныеЗаполненияДоговора = Новый Структура;
		СтрокиСКонтрагентом = ЭтаФорма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора","Владелец"));
		Если СтрокиСКонтрагентом.Количество() > 0 Тогда
			ДанныеЗаполненияДоговора.Вставить("Владелец", СтрокиСКонтрагентом[0].Метка);
		КонецЕсли;
		
		СтрокиСОрганизацией = ЭтаФорма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора","Организация"));
		Если СтрокиСОрганизацией.Количество() > 0 Тогда
			ДанныеЗаполненияДоговора.Вставить("Организация", СтрокиСОрганизацией[0].Метка);
		КонецЕсли;
		
		СтрокиСВидомДоговора = ЭтаФорма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора","ВидДоговора"));
		Если СтрокиСВидомДоговора.Количество() > 0 Тогда
			ДанныеЗаполненияДоговора.Вставить("ВидДоговора", СтрокиСВидомДоговора[0].Метка);
		КонецЕсли;
		
		Если ДанныеЗаполненияДоговора.Количество()> 0 Тогда
			
			Отказ = Истина;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполненияДоговора);
			
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

&НаКлиенте
Процедура ДекорацияСвернутьРазвернутьОтборыНажатие(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

#КонецОбласти

#Область ПанельКонтактнойИнформации

&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры

#КонецОбласти


#Область Отборы


&НаСервере
Процедура УстановитьОтборы()
	УстановитьОтборДоговорПодписанСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДоговорПодписанСервер()
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, 
		"ДоговорПодписан", ОтборДоговорПодписан, ОтборДоговорПодписан, ВидСравненияКомпоновкиДанных.Равно);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДействуетНаСервер()
	
	ЧислоИзмененных = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"СрокДействия",
		,
		ОтборДействуетНа,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ЗначениеЗаполнено(ОтборДействуетНа),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	ЧислоИзмененных = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"ДействуетБессрочно",
		,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ОтборДействуетНа),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	Если ЧислоИзмененных = 0 Тогда
		
		ГруппаДействуетНа= ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы, "ДействуетНа");
		
		Если ГруппаДействуетНа = Неопределено Тогда
			ГруппаДействуетНа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
				"ДействуетНа",
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетНа,
			"СрокДействия",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			ОтборДействуетНа,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДействуетНа,
			"ДействуетБессрочно",
			ВидСравненияКомпоновкиДанных.Равно,
			Истина,
			,
			ЗначениеЗаполнено(ОтборДействуетНа),
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	УстановитьВидимость(ЭтаФорма);
КонецПроцедуры


#КонецОбласти
